let handler = m => m 
 handler.all = async function (m) { 
 let chat = global.db.data.chats[m.chat] 
  
   if (/^اذكار الصباح|أذكار الصباح$/i.test(m.text) ) { //sem prefixo 
     conn.reply(m.chat, ` .☀🌹 أذكارالصباح🌹☀

🌴 حصن نفسك حصن نفسك🌴
💐 الحمد لله وحده ، والصلاة والسلام على من لا نبي بعده:

♡[ آية الكرسي]
♡ سورة الإخلاص-ثلاث مرات]
♡[ سورة الفلق-ثلاث مرات]
♡ سورة الناس-ثلاث مرات]

💐 أصبحنا وأصبح الملك لله ، والحمد لله، لا إله إلا الله وحده لا شريك له، له الملك وله الحمد وهو على كل شيء قدير، ربِّ أسألك خير ما في هذا اليوم وخير ما بعده وأعوذ بك من شر ما في هذا اليوم وشر ما بعده ربِّ أعوذ بك من الكسل وسوء الكبر، ربَّ أعوذ بك من عذابٍ في النار وعذاب في القبر .

💐 "اللهم بك أصبحنا وبك أمسينا وبك نحيا وبك نموت  وإليك النشور

💐 "اللهم أنت ربي لا إله إلا أنت خَلَقتني وأنا عَبْدُك وأنا على عهدك ووعدك ما استطعت وأعوذ بك من شر ما صنعت أبوء لك بنعمتك على وأبوء بذنبي فاغفر لي فإنه لا يغفر الذنوب إلا أنت

💐 اللهم إني أصبحت أشهدك وأشهد حملة عرشك ، وملائكتك وجميع خلقك ، أنك أنت الله لا إله إلا أنت وحدك لا شريك لك ، وأن محمداً عبدك ورسولك"( أربع مرات)

💐 "اللهم ما أصبح بي من نعمة أو بأحد من خلقك فمنك وحدك لا شريك لك ، فلك الحمد ولك الشكر "

💐 "اللهم عافني في بَدَني، اللهم عافني في سمعي، اللهم عافني في بصري، لا إله إلا أنت .اللهم إني أعوذ بك من الكفر، والفقر، اللهم إني أعوذ بك من عذاب القبر لا إله إلا أنت"( ثلاث مرات)

💐 ؛" حسبي الله لا إله إلا هو عليه توكلت وهو رب العرش العظيم "( سبع مرات )

💐 "اللهم إني أسألك العافية في الدنيا والآخرة،اللهم إني أسألك العفو والعافية في ديني ودنياي وأهلي ومالي،اللهم استر عوراتي وآمن روعاتي، اللهم أحفظني من بين يديَّ ومن خلفي وعن يميني وعن شمالي ومن فوقي وأعوذ بعظمتك أن أغتال من تحتي" .  

💐 "اللهم عَالِمَ الغيب والشَّهادة، فاطر السموات والأرض، رب كل شيء ومليكه، أشهد أن لا إله إلا أنت أعوذ بك من شر نفسي ومن شر الشيطان وشركه وأن اقترف على نفسي سوءًا أو أجُره إلى مسلم"

💐 "بسم الله الذي لا يضرُّ مع اسمه شيء في الأرض ولا في السماء وهو السميع العليم( "ثلاث مرات)

💐 "رضيت بالله رباً ، وبالإسلام ديناً وبمحمد صلى الله عليه وسلم نبياً"( ثلاث مرات)

💐 "يا حي يا قيوم برحمتك أستغيث أصلح لي شأني كُله ولا تَكِلْني إلى نفسي طرفة عين"

💐 "أصبحنا وأصبح الملك لله رب العالمين ، اللهم إني أسألك خير هذا اليوم : فتحه ، ونصره ،ونوره ،وبركته، وهداه، وأعوذ بك من شر ما فيها وشر ما بعده"

💐 "(أصبحنا على فطرة الإسلام وكلمة الإخلاص، ودين نبيَّنا محمد صلى الله عليه وسلم وملَّة أبينا إبراهيم حنيفاً مسلماً وما كان من المشركين"

💐 "سبحان الله وبحمده"( مائة مرة )

💐 "لا إله إلا الله وحده لا شريك له ،له الملك وله الحمد وهو على كل شيء قدير"( عشر مرات)

💐 "لا إله إلا الله وحده لا شريك له ،له الملك وله الحمد وهو على كل شيء قدير" 
( مائة مرة )

💐 "سبحان الله وبحمده عدد خلقهِ ورِضَا نفسِهِ وزِنُة عَرشِهِ ومِداد كلماته"( ثلاث بعد صلاة الفجر)
💐 عوذ بكلمات الله التامات من شر ماخلق ( ثلاث مرات)
💐 "أستغفر الله وأتوب إليه "(  مائة مرة في اليوم)

💐 الصلاه على النبي (عشر مرات) `, m) //wm, null, [['Menu', '#menu']], m) botones :V 
  
 } 
     
 if (/^اذكار المساء|أذكار المساء$/i.test(m.text) ) { //sem prefixo 
     conn.reply(m.chat, `🌴حصن نفسك🌴
         🌴 اذكار المساء🌴
          
💐  آية الكرسي
أَعُوذُ بِاللهِ مِنْ الشَّيْطَانِ الرَّجِيم°
بسم الله الرحمن الرحيم°
🌺 ِ(اللّهُ لاَ إِلَـهَ إِلاَّ هُوَ الْحَيُّ الْقَيُّومُ لاَ تَأْخُذُهُ سِنَةٌ وَلاَ نَوْمٌ لَّهُ مَا فِي السَّمَاوَاتِ وَمَا فِي الأَرْضِ مَن ذَا الَّذِي يَشْفَعُ عِنْدَهُ إِلاَّ بِإِذْنِهِ يَعْلَمُ مَا بَيْنَ أَيْدِيهِمْ وَمَا خَلْفَهُمْ وَلاَ يُحِيطُونَ بِشَيْءٍ مِّنْ عِلْمِهِ إِلاَّ بِمَا شَاء وَسِعَ كُرْسِيُّهُ السَّمَاوَاتِ وَالأَرْضَ وَلاَ يَؤُودُهُ حِفْظُهُمَا وَهُوَ الْعَلِيُّ الْعَظِيمُ.) [البقرة 255]
من قالها حين يصبح أجير من الجن حتى يمسي ومن قالها حين يمسي أجير من الجن حتى يصبح°°

أَعُوذُ بِاللهِ مِنْ الشَّيْطَانِ الرَّجِيمِ، 
بِسْمِ اللهِ الرَّحْمنِ الرَّحِيم
🌺 (قُلْ هُوَ اللَّهُ أَحَدٌ، اللَّهُ الصَّمَدُ، لَمْ يَلِدْ وَلَمْ يُولَدْ، وَلَمْ يَكُن لَّهُ كُفُوًا أحد.)
(ثلاث مرات) 

بِسْمِ اللهِ الرَّحْمنِ الرَّحِيم
🌺 (قُلْ أَعُوذُ بِرَبِّ الْفَلَقِ، مِن شَرِّ مَا خَلَقَ، وَمِن شَرِّ غَاسِقٍ إِذَا وَقَبَ، وَمِن شَرِّالنَّفَّاثَاتِ فِي الْعُقَدِ، وَمِن شَرِّ حَاسِدٍ إِذَا حَسَدَ.)
(ثلاث مرات) 

بِسْمِ اللهِ الرَّحْمنِ الرَّحِيم
🌺 (قُلْ أَعُوذُ بِرَبِّ النَّاسِ، مَلِكِ النَّاسِ، إِلَهِ النَّاسِ، مِن شَرِّ الْوَسْوَاسِ الْخَنَّاسِ، الَّذِي يُوَسْوِسُ فِي صُدُورِ النَّاسِ، مِنَ الْجِنَّةِ وَ النَّاسِ.)
(ثلاث مرات) 
من قالها حين يصبح وحين يمسي كفته من كل شىء°°

🌺 أَمسينا وَأَمسْـىَ المُـلْكُ لله وَالحَمدُ لله ، لا إلهَ إلاّ اللّهُ وَحدَهُ لا شَريكَ لهُ، لهُ المُـلكُ ولهُ الحَمْـد، وهُوَ على كلّ شَيءٍ قدير ، رَبِّ أسْـأَلُـكَ خَـيرَ ما في هـذه الليلة وَخَـيرَ ما بَعْـدَها ، وَأَعـوذُ بِكَ مِنْ شَـرِّ ما في هـذه الليلة وَشَرِّ ما بَعْـدَها، رَبِّ أَعـوذُبِكَ مِنَ الْكَسَـلِ وَسـوءِ الْكِـبَر ، رَبِّ أَعـوذُبِكَ مِنْ عَـذابٍ في النّـارِ وَعَـذابٍ في القَـبْر.°°

🌺 اللّهـمَّ أَنْتَ رَبِّـي لا إلهَ إلاّ أَنْتَ ، خَلَقْتَنـي وَأَنا عَبْـدُك ، وَأَنا عَلـى عَهْـدِكَ وَوَعْـدِكَ ما اسْتَـطَعْـت ، أَعـوذُبِكَ مِنْ شَـرِّ ما صَنَـعْت ، أَبـوءُ لَـكَ بِنِعْـمَتِـكَ عَلَـيَّ وَأَبـوءُ بِذَنْـبي فَاغْفـِرْ لي فَإِنَّـهُ لا يَغْـفِرُ الذُّنـوبَ إِلاّ أَنْتَ .°°
من قالها موقنا بها حين يمسي ومات من ليلته دخل الجنة وكذلك حين يصبح¦¦

🌺 رَضيـتُ بِاللهِ رَبَّـاً وَبِالإسْلامِ ديـناً وَبِمُحَـمَّدٍ صلى الله عليه وسلم نَبِيّـاً.°°
(ثلاث مرات)

من قالها حين يصبح وحين يمسي كان حقا على الله أن يرضيه يوم القيامة¦¦

🌺 اللّهُـمَّ إِنِّـي أَمسيْتُ أُشْـهِدُك ، وَأُشْـهِدُ حَمَلَـةَعَـرْشِـك ، وَمَلائِكَتِك ، وَجَمـيعَ خَلْـقِك ، أَنَّـكَ أَنْـتَ اللهُ لا إلهَ إلاّ أَنْـتَ وَحْـدَكَ لا شَريكَ لَـك ، وَأَنَّ ُ مُحَمّـداً عَبْـدُكَ وَرَسـولُـك.°°
من قالها أعتقه الله من النار¦¦

🌺 اللّهُـمَّ ما أَمسْىَ بي مِـنْ نِعْـمَةٍ أَو بِأَحَـدٍ مِـنْ خَلْـقِك ، فَمِـنْكَ وَحْـدَكَ لا شريكَ لَـك ، فَلَـكَ الْحَمْـدُ وَلَـكَ الشُّكْـر.°°
من قالها حين يصبح أدى شكر ليلته¦¦

🌺 حَسْبِـيَ اللّهُ لا إلهَ إلاّ هُوَ عَلَـيهِ تَوَكَّـلتُ وَهُوَ رَبُّ العَرْشِ العَظـيم.°°(سبع مرات)
من قالها كفاه الله ما أهمه من أمر الدنيا والأخرة¦¦

🌺 بِسـمِ اللهِ الذي لا يَضُـرُّ مَعَ اسمِـهِ شَيءٌ في الأرْضِ وَلا في السّمـاءِ وَهـوَ السّمـيعُ العَلـيم.°°
(ثلاث مرات)
من قالها لم يضره من الله شيء¦¦

🌺 اللّهُـمَّ بِك أَمْسَـينا َ وَبِكَ أَصْـبَحْنا ، وَبِكَ نَحْـيا وَبِكَ نَمُـوتُ وَإِلَـيْكَ المصير.°°

🌺 أَمْسيـنا عَلَى فِطْرَةِ الإسْلاَمِ، وَعَلَى كَلِمَةِ الإِخْلاَصِ، وَعَلَى دِينِ نَبِيِّنَا مُحَمَّدٍ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، وَعَلَى مِلَّةِ أَبِينَا إبْرَاهِيمَ حَنِيفاً مُسْلِماً وَمَا كَانَ مِنَ المُشْرِكِينَ.°°

🌺 سُبْحـانَ اللهِ وَبِحَمْـدِهِ عَدَدَ خَلْـقِه ، وَرِضـا نَفْسِـه ، وَزِنَـةَ عَـرْشِـه ، وَمِـدادَ كَلِمـاتِـه.°°
(ثلاث مرات)

🌺 اللهم عافِـني في بَدَنـي ، اللّهُـمَّ عافِـني في سَمْـعي ، اللّهُـمَّ عافِـني في بَصَـري ، لا إلهَ إلاّ أَنْـتَ.°

🌺 اللّهُـمَّ إِنّـي أَعـوذُبِكَ مِنَ الْكُـفر ، وَالفَـقْر ، وَأَعـوذُبِكَ مِنْ عَذابِ القَـبْر ، لا إلهَ إلاّ أَنْـتَ.°°

🌺 اللّهُـمَّ إِنِّـي أسْـأَلُـكَ العَـفْوَ وَالعـافِـيةَ في الدُّنْـيا وَالآخِـرَة ، اللّهُـمَّ إِنِّـي أسْـأَلُـكَ العَـفْوَ وَالعـافِـيةَ في ديني وَدُنْـيايَ وَأهْـلي وَمالـي ، اللّهُـمَّ اسْتُـرْ عـوْراتي وَآمِـنْ رَوْعاتـي ، اللّهُـمَّ احْفَظْـني مِن بَـينِ يَدَيَّ وَمِن خَلْفـي وَعَن يَمـيني وَعَن شِمـالي ، وَمِن فَوْقـي ، وَأَعـوذُ بِعَظَمَـتِكَ أَن أُغْـتالَ مِن تَحْتـي.°°

🌺 يا حَـيُّ يا قَيّـومُ بِـرَحْمَـتِكِ أَسْتَـغـيث أَصْلِـحْ لي شَـأْنـي كُلَّـه وَلا تَكِلـني إِلى نَفْـسي طَـرْفَةَ عَين.°°

🌺 أَمسيَــنا وَأَمسْى المُـلكُ للهِ رَبِّ العـالَمـين 

🌺 اللّهُـمَّ إِنِّـي أسْـأَلُـكَ خَـيْرَ هـذه اللـيلةَ فَـتْحَهُا وَنَصْـرَهُا ، وَنـورَهُا وَبَـرَكَتَـهُا، وَهُـداهُا، وَأَعـوذُ بِـكَ مِـنْ شَـرِّ ما فـيهِا وَشَـرِّ ما بَعْـدَها°°

🌺 اللّهُـمَّ عالِـمَ الغَـيْبِ وَالشّـهادَةِ فاطِـرَ السّماواتِ وَالأرْضِ رَبَّ كـلِّ شَـيءٍ وَمَليـكَه ، أَشْهَـدُ أَنْ لا إِلـهَ إِلاّ أَنْت ، أَعـوذُ بِكَ مِن شَـرِّ نَفْسـي وَمِن شَـرِّ الشَّيْـطانِ وَشِـرْكِه ، وَأَنْ أَقْتَـرِفَ عَلـى نَفْسـي سوءاً أَوْ أَجُـرَّهُ إِلـى مُسْـلِم.°°

🌺 أَعـوذُ بِكَلِمـاتِ اللّهِ التّـامّـاتِ مِنْ شَـرِّ ما خَلَـق.°°
(ثلاث مرات)

🌺 اللَّهُمَّ صَلِّ وَسَلِّمْ وَبَارِكْ على نَبِيِّنَا مُحمَّد.°°
من صلى عليه صلاة واحده صلى الله عليه بها عشرآ¦¦

🌺 اللَّهُمَّ إِنَّا نَعُوذُ بِكَ مِنْ أَنْ نُشْرِكَ بِكَ شَيْئًا نَعْلَمُهُ ، وَنَسْتَغْفِرُكَ لِمَا لَا نَعْلَمُهُ.°°

🌺 اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ الْهَمِّ وَالْحَزَنِ، وَأَعُوذُ بِكَ مِنْ الْعَجْزِ وَالْكَسَلِ، وَأَعُوذُ بِكَ مِنْ الْجُبْنِ وَالْبُخْلِ، وَأَعُوذُ بِكَ مِنْ غَلَبَةِ الدَّيْنِ، وَقَهْرِ الرِّجَالِ.°°

🌺 لاإله إلا الله وحده لاشريك له ، له الملك و له الحمد وهو على كل شيء قدير..(10) مرات°°

🌺 أسْتَغْفِرُ اللهَ العَظِيمَ الَّذِي لاَ إلَهَ إلاَّ هُوَ، الحَيُّ القَيُّومُ، وَأتُوبُ إلَيهِ..(100)مرة°°

🌺 سبحان الله وبحمده.(100)مرة°° 

🌺 الاكثار من الصلاة على الرسول صلی الله عليه و سلم..
__________🌺_________   


        🌸🌸🌸🌸🌸
سبحانك اللهم و بحمدك اشهد ان لا اله الا انت استغفرك و اتوب اليك .
        🌸🌸🌸🌸🌸
                           

   🌿 الإستعانة بالله 🌿
📝 قال شيخ الإسلام ابن تيمية: 
📜"تَأَمَّلْتُ أَنْفَعَ الدُّعَاءِ فَإِذَا هُوَ سُؤَالُ الْعَوْنِ عَلَى مَرْضَاتِهِ، ثُمَّ رَأَيْتُهُ فِي الْفَاتِحَةِ فِي {إِيَّاكَ نَعْبُدُ وَإِيَّاكَ نَسْتَعِينُ} [الفاتحة: ] ،
📜 وَلِهَذَا كَانَ مِنْ أَفْضَلِ مَا يُسْأَلُ الرَّبُّ تَبَارَكَ وَتَعَالَى.. الْإِعَانَةُ عَلَى مَرْضَاتِهِ، وَهُوَ الَّذِي عَلَّمَهُ النَّبِيُّ -صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ -لِحِبِّهِ مُعَاذِ بْنِ جَبَلٍ رَضِيَ اللَّهُ عَنْهُ، فَقَالَ: 
💎 «يَا مُعَاذُ، وَاللَّهِ إِنِّي لَأُحِبُّكَ، فَلَا تَنْسَ أَنْ تَقُولَ دُبُرَ كُلِّ صَلَاةٍ: اللَّهُمَّ أَعِنِّي عَلَى ذِكْرِكَ وَشُكْرِكَ وَحُسْنِ عِبَادَتِكَ» . 💎
ً `, m) //wm, null, [['Menu', '#menu']], m) botones :V 

   } 
  
 if (/^دعاء$/i.test(m.text) ) { //sem prefixo 
     conn.reply(m.chat, `🌴دعاء الخروج من المنزل🌴 

عن أنس بن مالك رضي الله عنه أن رسول الله صلى الله عليه وسلم قال: مَنْ قالَ يعني إذا خرج من بيته باسْمِ اللَّهِ تَوَكَّلْتُ على اللَّهِ وَلاَ حَوْلَ وَلاَ قُوَّةَ إِلاَّ باللَّهِ يُقالُ لَهُ: كُفِيتَ وَوُقِيتَ وَهُدِيتَ فَتَتَنَحَّى لَهُ الشَّيَاطِينُ فَيَقُولُ لَهُ شَيطَانٌ آخَرُ: كَيْفَ لَكَ بِرَجُلٍ قَدْ 
هُدِيَ وكُفِيَ وَوُقِي

َ
[ رواه أبو داود (٥٠٩٥) 

يقال حينئذ: أي يناديه ملك يا عبد الله هُديت: بصيغة المجهول أي طريق الحق وكُفيت: أي هَمَّك وَوُقيت: من الوقاية أي حُفِظت`, m) //wm, null, [['Menu', '#menu']], m) botones :V 
  
 } 
 return !0 } 
 export default handler