let handler = m => m;

handler.all = async function (m) {
  let chat = global.db.data.chats[m.chat];
  let responses;
  if (/^احبك|^ابيك$|اتزوجك|اتزوجني|ديابلو تحبني؟|ديابلو تحبني|ديابلو نرتبط؟|ديابلو نرتبط|انت حقي|اموت فيك|تحبني|تزوجني]$/i.test(m.text)) {
    responses = [
      '*شــكــراً قــلبــي 🩷*', 
      '*خــلــنــي أفــكــر فــي الأمــر*', 
      '*حــتــى انــااا يــاروحــي*', 
      '*اســتــحــيـيـيـي يــاخــي 😌*', 
      '*خــلاص اســتــحــي وخــر/ي 🥲*', 
      '*اســكـتـتـتـتـت تــرا اضـربـك عـيـب وش هـل كـلام*', 
      '*طــيــب و بــعــديــن 💀*',
      '*مــنــجــدك انــت/ي 💀*',
      '*حــبــك بــرص يــرصــك رص*',
    ];
  } else if (/^$السلام عليكم|^هاي$|سلام عليكم|^مرحبا$/i.test(m.text)) {
    responses = [
      '*وعــليــكــم الــســلام🤍*', 
      '*وعــلــيــكــم الــســلام حــبــي مــنــور*', 
      '*وعـلـيـكـم الـسـلام يـهـلا كـيـفـك شـخـبـارك ان شـاء الله بـخـيـر؟🦉*', 
      '*وعـليـكـم الـسـلام ورحـمـة الله وبـركـاتـه❤*',
    ];
  } else if (/^كيفيك|كيفك|كيفيك|ديابلو كيفك|ديابلو كيفك؟|شلونك|شلونك؟|كيف الأحوال|كيف حالكم$/i.test(m.text)) {
    responses = [
      '*كــل شـيء بــخــيــر الــحــمــد لله🩷*', 
      '*مـدري🤍*', 
      '*الــحــمد لله مــاشــي الــحــال❤*', 
      '*الــحــمد الله❤‍🔥*', 
      '*اذا انــت بــخــيــر انــا بــخــيــر😳*',
      '*اا.. بــخــيــر*',
      '*غــريــبــة تــســأل عــنــي؟*',
    ];
  } else if (/^ياواطي|كلب|كول خرا|كلخرا|خرا عليك|تفو|كل تبن|ديابلو كل تبن|كلتبن|كل زق|كلزق|كزق|زق$/i.test(m.text)) {
    responses = [
      '*عــيــب😡*', 
      '*تــأدب يــورع😔*', 
      '*احــا يــا وســخ😱*', 
      '*الله يــهــديــك يــارب😞*', 
      '*ولــك عــيــب يــا طــفــل🤫*',
      '*يــااعـيـيـب الــشــووم عــلــيــك😧😧*',
    ];
  } else if (/^شو عم تعمل|ماذا تفعل|ديابلو شتسوي|ديابلو شتسوي؟|ايش تسوي|ديابلو ايش تسوي|ديابلو شتسوي؟|شتسوي|شتسوي؟|ديابلو ايش تسوي؟|وش تسوي|ايش قاعد تسوي$/i.test(m.text)) {
    responses = [
      '*ولا شــيء و انــت🤓*', 
      '*اشــرب شــاي تــفــضــل😎*', 
      '*اتــفــرج عــلــى ســولــو لــيــفــلــيــنــق🫡*', 
      '*أشــاهــد انــمــي🤯*', 
      '*اكــلــمــك🙄*',
      '*احـــتــســي بــعــض مــن الــنــبــيــز🍺*',
      '*احـــتــســي بــعــض مــن الــقــهــوة☕*',
      '*احـــتــســي بــعــض مــن الــشــاي🫖*',
    ];
  } else if (/^ههههه|هههههه|ههههههه|هههههههه|ههههههههه|هههههههههه$/i.test(m.text)&& !chat.isBanned) {
    responses = [
      '*دوم هــل ضــحــكــة😂*', 
      '*دايــمــه ❤*', 
      '*دوم يــا رب🫡*', 
      '*هـهـه وجـــع*', 
      '*ههههههههه*', 
      '*عــلــى شــو عم تضحك ولاك جردون🤨🤨*', 
      '*ضـحـكـونـي مـعـاكـم بـالـيـز🥹🥹*', 
      '*دوم*',
      '*كــأنــك فــلــيــتــهــا صــح*',
      '*خــلاص يــاســخــيــف*',
      '*ه ه ه ه ه ضــحــكــة عــنــز🐐*',
      '*يعنني انا الفله*',
    ];
  } else if (/^مساء النور|صباح الخير|ديابلو صباح الخير|صباح النور|صباح الورد$/i.test(m.text)) {
    responses = [
      '*صـبـاحـك عـسـل يـاعـسـل ويـن الـقـشـطـة ❤*', 
      '*.صــبــاح الــمــدرســة😂*', 
      '*صــبــاح ولا مــســاء🦉*', 
      '*انــا بــنــام تــصــبــح عــلــى خــيــر😭*', 
      '*روح كــمــل نــوم😂😂*',
    ];
  } else if (/^ديابلو تصبح على خير|تصبح على خير|تصبحو على خير|تمسو على خير|ديابلو تمسي على خير$/i.test(m.text)) {
    responses = [
        '*و أنـت / أنـتِ الـخـيـر ومـنـبـعـه*\n*أحـلام سـعـيـدة وكـوابـيـس بـعـيـدة 🪅*', 
        '*وانـت مـن اهـل الـخـيـر حـبـيـبـي✨💜*', 
    ];
    } else if (/^ملل|ديابلو ملل|مللل|ملللل$/i.test(m.text)) {
      responses = [
        '*سـكـر تـمـك عـارفـيـن*',
        '*يـالـيـل مـو وقـتـك تـرا*', 
      ];
    } else if (/^ديابلو ادعية|ادعية$/i.test(m.text)) {
      responses = [
        '*ثــلاثــة أدعــيــة لا تــنــســاهــا :*\n*- اللهم اني اسـألـك حـسـن الـخـاتـمـة🤍*\n*- اللهم ارزقني توبة نصوحاً قبل الـمـوت🤍*\n*- اللهم يا مقلب القلوب ثبت قلبي على دينك🤍*',
      ];
  } else if (/^مساء النور|ديابلو مساء الخير|مساء الخير|مساء/i.test(m.text)) {
    responses = [
     '*مسائك عسل ياعسل ❤*', 
     '*مساء التوت ياحلو ياكتكوت شو عم يصير معك حياتك حلوة ولا عم تموت😉*',
     '*مساء العنبر ايش رايك تعطيني النمبر لأنو انا لما شفتك عيوني ماعم تتذمر على هل منظر😊*',
     '*انا بنام تمسي على خير😭*', 
     '*روح كمل نوم😂😂*',
    ];
  }else if (/^اخرس|اسكت|ديابلو اخرس|اسكت شوي|يا ابني  اسكت$/i.test(m.text)) {
    responses = [
      '*ايش دخلك💀*',
      '*حاضر*',
      '*مب على كيفك انقلع بس🦉*', 
      '*لا مين انت عشان تسكتني😔*', 
      '*اسكت انت🤫*',
      '*اخرس انت*',
      '*اسكتتتتتتتتتتتتتتتتتتتت*',
    ];
  }else if (/^منور|ديابلوو منور|نورت$/i.test(m.text)) {
    responses = [
      '*الــنــور نــورك🫡🤍*', 
      '*يــزيــن نــوره الــي نــور*', 
      '*اخــذ نــورك😔*', 
      '*يــزيــنــك❤*',
    ];
  } else if (/^وينك|زمان عنك|ديابلو اشتقت لك|فينك من زمان|وينك عني|اشتقت لك$/i.test(m.text)) {
    responses = [
      '*ســم/ي يــاقــلــبــي 🫡🤍*', 
      '*اكــيــد اشــتــقــتــوا لــي صــح ولا 🦉*', 
      '*يــزيــن مــن يــســال عــنــي يــنــاس 😔*', 
      '*امــر يــقــلــبــي يــاعــيــونــي 🦉❤*',
      '*هــلا عــيــون ديــابــلــو اع يــحــظــي فــيــك*',
      '*اطــلــق مــن الــلــي يــســأل عــنــي عــيــونــي تــبــي شــي؟*',
      '*عــيــونــي ❤*',
      '*اشــتــقــتــو لــي؟ ❤*',
    ];
  } else if (/^وين عقلك|غبي|^سري$|بشقك|بزر|سكر تمك|يحمار|يجحش|جحش|ياثور|ثور$|تيس|طفل|خاين|دحدر|انقلع|ملقوف|دزي|دز|اذلف$/i.test(m.text)) {
    responses = [
      '*عــيــب🤫*', 
      '*اســتــحــي عــلــى وجــهــك يــا ورع💀*', 
      '*دز لوحــدك يــالــورع😔*', 
      '*مــالــك دخــل🦉*',
      '*دحــدر انــت*',
      '*فــارق*',
      '*شــقــلــب*',
      '*انــكــلــع*',
      '*ســكــر تــمــك انــت*',
      '*ســد بــوزك*',
      '*ســد نــيــعــك*',
      '*هــيــا تــخــارج*',
      '*الله يــســامــحــك*',
    ];
  } else if (/^عيوني$/i.test(m.text)) {
    responses = [
      '*فــديــت عــيــونــك*',
      '*ياعمري عيونك احلى من القمر لأنك نجمة و الشمس من النجوم و القمر مايتقارن بعيونك لأن عيونك مثل الشمس اللي تحرق قلبي,اا نسيت انت/ي قلبي*',
      '*عــيــونــي و عــيــونــك واحــد*',
      '*دخــيــل عــيــونــك*',
      '*لــقــد اغــرمــت فــيــك*',
      '*وزيــنــوو*',
      '*عــيــونــك عــيــون اســد*',
      '*احــرجــتــنــي يــيــي*',
      '*عــيــونــي احــلــى*',
      '*مــاش*',
    ];
  } else if (/^$افا$|افاا$|افا$|افااا$/i.test(m.text)&& !chat.isBanned) {
    responses = [
      '*طــحــت مــن عيــنــي*', 
      '*لــيــه؟*', 
      '*مــعــلــيــه*',
      '*افــا عــلــيــك انــت*',
      '*بــلا افــا بــلا شــو حــل عــنــي*',
      '*طــالــع مــنــهــا*',
      '*مــافــيــه افــا*'
    ];
  } else if (/^$اما$|^اماا$|^اما$|^امااا|اماااا|امااااا|اماااااا$|منجدك|ديابلو منجدك؟|ديابلو منجدك|قول ولله|قول ولله؟|منجدك؟|منجد؟$|^منجد^$/i.test(m.text)&& !chat.isBanned) {
    responses = [
      '*اي ولله*', 
      '*لا مــن ابــوي ههه*', 
      '*مــو مــــصــدق؟؟*', 
      '*لا كــذاب ههه*', 
      '*لاتــصــدق طــز*', 
      '*لاتــمــون*', 
      '*لا مــن مــزح*', 
      '*تــصــدق بــســرعــة انــت*', 
      '*خــلاص تــراك زودتــهــا*', 
      '*بــمــزح مــعــك*', 
    ];
  } else if (/^هم$|همم|همممم|همممم|هممممم|هممممممم^$/i.test(m.text)&& !chat.isBanned) {
    responses = [
      '*ايــش؟*', 
      '*فــاضــيــن نــهــمــهــم احــنــا؟؟*', 
      '*مــريــض*',
      '*يــليــل*',
      '*ازعــجــتــنــا*',
      '*تــرا هــم وحــدة تــكــفــي*',
      '*اســتــغــفــر الله الــعــظــيــم و اتــوب الــيــه*',
      '*لاحــول ولا قــوة الا بــالله*',
      '*جــلــطــتــنــي*',
      '*بــس بــس خــلاص جــنــنــتــنــي*',
      '*اعــوذ بــالله مــنــك*',
      '*الله يــهــديــك بــس*',
    ];
  } else if (/^اسمع|بقولك|تسمعني|لاتقول ل احد|ديابلو اسمع|ديابلو اسمع؟|لاتقول|ل احد|تسمعني؟|بقولك؟|اسمع؟$/i.test(m.text)) {
    responses = [
      '*هــلا*', 
      '*ايــش؟*', 
      '*شــو*', 
      '*ايــش هــو؟*',
      '*تمــطــط كــثــيــر انــت تــكــلــم؟؟!*',
      '*خــلــصــنــي وش فــيــه*',
      '*توكــل لاتــقــول مــافــيــنــي فــضــول*',
      '*نــنــن ســوالــيــفــك كــثــيــرة*',
    ];
  } else if (/^بشري|انسان|بشري$/i.test(m.text)&& !chat.isBanned) {
    responses = [
      '*ايــش شــايــفــنــي؟*',
      '*شــرايــك يــعــنــي؟*',
      '*لاتــغــلــط بــس*',
      '*هــهــه تــخــيــل اكــون بــشــري*',
      '*امــا بــشــري*',
    ];
  } else if (/^مياو|قول مياو|ديابلو قول ميو|ميو؟|مياو|ميو$/i.test(m.text)) {
    responses = [
      '*مــيــن يــقــول مــيــاو ب 2024🧐*',
      '*مــيــوو😖🐾*',
      '*شــهــل قــرف💀*',
      '*غــبــي انــت؟🤨*',
      '*انــت غــبــي ولا تــســتــغــبــي🤔*',
      '*تــســتــهــبــل؟☠️*',
      '*بــشــري غــريــب انــت🐱*',
      '*يــلــيــل مــاتــطــفــش🫠*',
      '*😾مــيــاو🐈🐾*'
    ];
  } else if (/^$مع السلامة|ديابلو مع السلامة|^باي$|^سلام$/i.test(m.text)) {
    responses = [
      '*الله مــعــك يــاقــلــبــي🤍*', 
      '*بــاي بــاي*',
      '*بــاي يــاقــلــبــي*',
      '*بــاي يــاحــلــو*',
      '*بــاي يــاســخــيــف*',
      '*بــاي ياعيوني*',
      '*بــاي يــاطــفــل*',
    ];
  } else if (/^بوو$/i.test(m.text)) {
    responses = [
      '*يــا شــيــخ خـــذ فـجـعـتـنـي*\n\n\n*(قــلــب طــبــعــاً❤️)*', 
    ];
  } else if (/^بخ$/i.test(m.text)) {
    responses = [
      '*يــمــه يــمــه خــفــت بـمـوـت 😫*', 
    ];
    } else if (/^ديابلو صلي على النبي|صلي على النبي$/i.test(m.text)) {
      responses = [
      '*الـلـهـم صــلِ عـلـى مـحـمـد والِ مـحـمـد❤*', 
    ];
  } else if (/^انميات طويلة|ديابلو انميات طويلة$/i.test(m.text)) {
      responses = [
          '*────────⊹⊱✫⊰⊹────────*\n*ا Gintama*\nعدد الحلقات: 367\n*عدد الاجزاء: 8*\nعدد الافلام: *2*\n*عدد حلقات الاوفا: 2*\n*التصنيف: كوميديا - اكشن - شونين*\n*────────⊹⊱✫⊰⊹────────*\n*ا Beelzebub*\n*عدد الحلقات: 60*\n*عدد الحلقات الخاصة: 1*\n*التصنيف: كوميديا - شياطين - اكشن*\n*────────⊹⊱✫⊰⊹────────*\n*ا JoJo no kimyou no bouken*\n*عدد الحلقات: 152*\nعدد الاجزاء: 4\n*التصنيف:شونين - مغامرات - اكشن*\n*────────⊹⊱✫⊰⊹────────*\n*ا  Hunter x Hunter (2011)*\n*عدد الحلقات: 148*\n*عدد الافلام: 2*\n*التصنيف: شونين - مغامرات - اكشن*\n*────────⊹⊱✫⊰⊹────────*\n*ا Bleach*\nعدد الحلقات: *366*\n*عدد الافلام: 4*\n*التصنيف: شونين - كوميديا - اكشن*\n*ملاحظة: هناك جزء ثاني قادم للأنمي*\n*────────⊹⊱✫⊰⊹────────*\n*ا Fairy tail*\n*عدد الحلقات: 328*\n*عدد الاجزاء: 3*\n*عدد الافلام: 2*\n*عدد حلقات الاوفا: 5*\n*التصنيف: كوميديا - مغامرات - سحر*\n*────────⊹⊱✫⊰⊹────────*\n*ا Kuroko no basket*\n*عدد حلقات الانمي: 75*\n*عدد الاجزاء: 3*\n*عدد الافلام: 1*\n*التصنيف: شونين - مدرسي - رياضي*\n*────────⊹⊱✫⊰⊹────────*\nا hajime no ippo\n*عدد الحلقات: 125*\n*عدد الاجزاء: 3*\n*عدد حلقات الاوفا: 1*\n*عدد الحلقات الخاصة: 1*\n*التصنيف: رياضي - شونين - كوميديا*\n*────────⊹⊱✫⊰⊹────────*', 
      ];
  } else if (/^انميات قصيرة|ديابلو انميات قصيرة$/i.test(m.text)) {
    responses = [
        '*────────⊹⊱✫⊰⊹────────*\n*ا Zankyou no terror*\n*عدد الحلقات: 11*\n*التصنيف: نفسي - إثارة*\n*────────⊹⊱✫⊰⊹────────*\n*ا Nisekoi*\n*عدد الاجزاء: 2*\n*عدد الحلقات:الاول: 20 / الثاني: 12*\n*عدد حلقات الاوفا: 5*\n*التصنيف: كوميدي - رومنسي*\n*────────⊹⊱✫⊰⊹────────*\n*ا Akatski no yona*\n*عدد الحلقات: 24*\n*عدد حلقات الاوفا: 3*\n*التصنيف: اكشن - كوميديا - رومنسي*\n*────────⊹⊱✫⊰⊹────────*\n*ا Mirai nikki\nعدد الحلقات: 26*\n*عدد حلقات الاوفا: 1*\n*التصنيف: اكشن - فوق الطبيعة*\n*────────⊹⊱✫⊰⊹────────*\n*ا Boku dake ga inai machi*\n*عدد الحلقات: 12*\n*التصنيف: نفسي - فوق الطبيعه*\n*────────⊹⊱✫⊰⊹────────*\n*ا toradora*\n*عدد الحلقات: 25*\n*التصنيف: كوميديا - رومنسي - مدرسي*\n*────────⊹⊱✫⊰⊹────────*\n*ا Code geass*\n*عدد الاجزاء: 2*\n*عدد الحلقات:الاول: 25 / الثاني: 25*\n*عدد حلقات الاوفا: 1*\n*عدد الافلام: 7*\n*التصنيف: اكشن - دراما - آلات*\n*────────⊹⊱✫⊰⊹────────*\n*ا Another*\n*عدد الحلقات: 12*\n*التصنيف: غموض - رعب - مدرسي*\n*────────⊹⊱✫⊰⊹────────*\n*ا shigatsu wa kimi no uso*\n*عدد الحلقات: 22*\n*عدد حلقات الاوفا: 1*\n*التصنيف: دراما - موسيقى - رومنسي*\n*────────⊹⊱✫⊰⊹────────*\n*ا Charlotte*\n*عدد الحلقات: 13*\n*عدد الحلقات الخاصه: 1*\n*التصنيف: مدرسي - قوى خارقة*\n*────────⊹⊱✫⊰⊹────────*\n', 
    ];
  } else if (/^ديابلو تكرهني|تكرهني؟|تكرهني|ديابلو تكرهني؟$/i.test(m.text)) {
    responses = [
      '*لــو الــعــالــم كــلــه يــكــرهــك*\n*انــا بــظــل....*\n\n\n*احــبــك ♥️*', 
      '*لــو الــعــالــم كــلــه يــكــرهــك*\n*انــا بــظــل....*\n\n\n*اكــرهــك*\n*مــو فــارقــة مــعــي😂*', 
      '*لــو الـــعـــالــم كــلــه يــكــرهــك*\n*انـا بــظـــل....*\n\n\n*تـحـسـب بـقـول احـبـك هـيـا دز تـوكـل اطـلـب الله*', 
  ];
  } else if (/^ديابلو نرتبط؟|ديابلو نرتبط|نرتبط|نرتبط؟$/i.test(m.text)) {
    responses = [
        '*لــلأســـف انـا خــادم ريـمـورو مـا ارتـبـط مـع الـنـاس ❤*', 
        '*لـــــوءء*',
        '*كــم مــعــك مــصــاري؟*',
    ];
  } else if (/^وينك|^ميت$|ديابلو عايش؟|^مات$|ديابلو عايش|عايش|عايش؟$/i.test(m.text)) {
    responses = [
      '*انــا عــايــش*',
      '*ايــش تــبــي*',
      '*ازعــجــتــنــا*',
      '*خـلاص ياخــي*\n*انــا مــيــت*',
    ];
  } else if (/^ديابلو اعطيني بوسة|ديابلو عطيني بوسة|اعطيني بوسة$/i.test(m.text)) {
    responses = [
      '*خـــذ💦💦*', 
      '*لـــــوءء*',
    ];
  } else if (/^حرامي|سراق$/i.test(m.text)) {
    responses = [
      '*دلـيـلـك ويــن ؟*\n*انـا مـتـاكـد انـك انـت الـحـرامـي*',
      '*لقد كـشـفـتـنـي اين اذهب اين لقد كشفتني*',
    ];
  } else if (/^لا$/i.test(m.text)&& !chat.isBanned) {
    responses = [
      '*الا*', 
      '*مــو عــلــى كــيــفــك*', 
      '*مــيــن قــال لــك؟*', 
    ];
  } else if (/^انا|انا؟$/i.test(m.text)&& !chat.isBanned) {
    responses = [
    '*لا انــا*',
    ];
  } else if (/^ربيع$/i.test(m.text)&& !chat.isBanned) {
    responses = [
      '*لا شــتــاء هه هه هه*',
      '*مــاتــعــرف تــحــل عــن ربــيــع*',
      '*يــرحــم اهــلــك خــل ربــيــع بــحــالــه*',
      '*يـالــيــلل',
      '*ربــيــع ويــن وانــت ويــن صــرنــا بــالصــيــف*',
      '*عــصــيــر ربــيــع قــصــدك؟*',
      '*ربــيــع صــحــة لــلــجــمــيــع*',
    ];
  } else if (/^الحمدلله$/i.test(m.text)) {
    responses = [
      '*ادام الله حــمــدك*',
    ];
  } else if (/^اي منجدي$/i.test(m.text)) {
    responses = [
      '*احــيــيــه*',
      '*احــتــيــيــن*',
      '*ثــلاث احااات*',
    ];
  } else if (/^انزلي|اتحداك$/i.test(m.text)&& !chat.isBanned) {
    responses = [
      '*تــعــال لــو فــيــك خــيــر*',
      '*مــســوي قــوي*',
      '*اوف يــا مــهــايــطــي*',
      '*لا بــلــيــز خــوفــتــنــي*',
    ];
  } else if (/^احا$/i.test(m.text)&& !chat.isBanned) {
    responses = [
      '*احــيــيــه*',
      '*احــتــيــيــن*',
      '*ثــلاث احااات*',
    ];
  }

  if (responses) {
    let randomIndex = Math.floor(Math.random() * responses.length);
    conn.reply(m.chat, responses[randomIndex], m);
  }
  return !0
};

export default handler;

