import fs from "fs"
let handler = m => m
 handler.all = async function (m, { conn, command, text }) {
    let chat = global.db.data.chats[m.chat]
   
 let x = `${pickRandom([ '~_سي سي_~','~_لولوش_~','~_نير_~','~_ميسا_~', '~_ال_~','~_لايت_~' ,'~_غون_~','~_كيلوا_~', '~_ليوريو_~','~_هيسوكا_~','~_كورابيكا_~','~الوكا~' ,'~_جين فريكس_~','~_اشيلاد_~' ,'~_ثورفين_~', '~_استا_~' ,'~_سيبر_~','~_كوشينا_~' ,'~_ميناتو_~','~_تيماري_~','~_شيكامارو_~','~_باين_~' ,'~_ايتاتشي_~', '~_ريم_~','~_رين_~','~_شيسوي_~' ,'~_كاكاشي_~','~_اوبيتو_~', '~_مادارا_~','~_لي_~' ,'~_غاي_~','~_ساكورا_~' ,'~_هيناتا_~', '~_ساسكي_~' ,'~_ناروتو_~' ,'ا~_سونا_~','~_كيريتو_~' ,'~_يوتا_~','~_نانامي_~', '~_سوكونا_~','~_يوجي_~', '~_نوبارا_~','~_ميغومي_~' ,'~_غوجو_~','~_زينو_~' ,'~_هاك_~','~_يونا_~' ,'~_تينغن_~','~_رينغوكو_~', '~_توكيتو_~','~_كوكوشيبو_~' ,'~_يوريتشي_~','~_ميتسوري_~' ,'~_سانيمي_~','~_اوباناي_~', '~_شينوبو_~','~_غيو_~' ,'~_كاناو_~','~_لاك_~' ,'~_ماغنا_~','~_نويل_~','~_يامي_~', '~_يونو_~','~_فينرال_~', '~_شوتو_~','~_باكوغو_~' ,'~_ديكو_~','~_اول مايت_~' ,'~_دابي_~','~_توغا_~', '~_تانجيرو_~','~_نيزوكو_~' ,'~زينيتسو~','~اينوسكي~', '~دوما~','~اكازا~', '~_موزان_~','~_كيم_~','~_روبين_~','~_هانكوك_~', '~_اشيلاد_~','~_مادارا_~','~_لوفي_~','~_نامي_~', '~_اوسوب_~','~_شانكس_~','~_غيو_~','~_اثي_~', '~_نيزوكو_~','~_ساسكي_~','~_ناروتو_~', '~_ميكاسا_~','~_ايرين_~','~_ايروين_~','~_ثورفين_~','~_ثوركيل_~','~_شيكي_~','~_كايدو_~','~ا_رمين_~','~_جان_~','~_تانجيرو_~','~_ريفانا_~','~_ميليوداس_~','~_كينغ_~','~_غوثر_~', '~_إسكانور_~','~_مارلين_~','~_يونو_~','~_استا_~','~_يامي_~','~_يوسارين_~','~_ليخت_~','~_موبو_~','~_ادوارد_~','~_ال_~','~_لايت_~','~_كاغامي_~', '~_كوروكو_~','~_ياغامي_~','~_كيرا_~','~_اشيتو_~','~_ايساغي_~','~_روي_~','~_تيماري_~','~_ساكورا_~','~_اينو_~','~_ايتشيغو_~','~_اوراهارا_~','~_ايزن_~','~_ياماتو_~','~_رينغوكو_~','~_اينوسكي_~','~_كو_~','~_فوتابا_~','~_رين_~','~_ريوسي_~','~_غوجو_~','~_يوجي_~','~_سوكونا_~','~_ريفي_~','~_فيفي_~','~_زورو_~','~_سانجي_~','~_فرانكي_~','~_انيا_~', '~_يور_~','~_اودين_~','~_لويد_~','~_ليفاي_~','~_زيك_~','~_ماي_~','~_ماري_~','~_توكا_~','~_كانيكي_~','~_شو_~','~_ايسي_~','_~شين_~','~_غون_~','~_غاي_~','~_كيلوا_~','~_ليوريو_~','~_بان_~','~_ياتشيرو_~','~_زاراكي_~','~_كيوراكو_~','~_ايشيدا_~','~_نيرو~'])}`

let l = Math.floor(Math.random() * x.length);

let top = `*${x}*`

if (/^كت$/i.test(m.text) ) {
handler.admin = true
    m.reply(top, null)}}
export default handler

function pickRandom(list) {
return list[Math.floor(Math.random() * list.length)]}