let handler = async (m, { conn }) => {
    let videos = ['./views/img/استمارة.mp4', './views/img/استمارة2.mp4']; // قم بتغيير المسارات لتناسب المقاطع الصوتية التي تريدها
    let randomVideo = pickRandom(videos); // اختيار مقطع عشوائي من المصفوفة

    let more = String.fromCharCode(8206);
    let done = '🌀';
    m.react(done);

    let teks = `
${pickRandom([`*╭━━━[ استماره ]━━━━⬣*
*⇜أهلا بك بأستقبال  نقابة┋𝑻𝐞𝒎𝒑𝒆𝒔𝒕🌀*
*↵⟦ ✦.✿بـَّـــسْـمِ الْلّٰه الرحَــــمٰــنِٓ الرَّحِـــيـــمِ✿. ✦ ⟧*
 *✦        استمارة 📜 دخول         ✦*
*┃❐━──━⌬〘•🐉•〙⌬━──━❐┃*

*〖 أبثُّ كلماتي معلنة فجرًا جديدًا يصاحبه نور قلم فريد، فنستقبلكم والبشر مبتسمين، ونمزج ترحيبنا بشذى عطرنا، فتصافحكم أكفنا بالحب؛ لنهديكم أجمل معانينا، فأهلًا ومرحبًا بك.💗 〗* 
*┃❐━──━⌬〘•🐉•〙⌬━──━❐┃*

*❐ اللــ🌀ــقـب :  _⊑ ⊒_*

*❐ الإنـــ🧧ــمـي : _⊑ ⊒_*

*❐ ذكـر/انثـى 👫:  _⊑ ⊒_*

*❐  إرسال صورة للشخصية يلي بدك لقبها📸*

*❐ مـن طـ👨🏻‍⚖️ـرف ؟ : _⊑ ⊒_*

*〚 الالقاب مباشر ‼️Live 〛↶*
*❐ الالقاب المأخوذة ↶*
*〚 https://msha.ke/soultimpest#about-1 〛*

*⟣⦁━♅━⦁⟢ ~‹❲~ ملاحضات ~❳›~ ⟣⦁━♅━⦁⟢*

*⸎ يلزم اختيار القاب تابعة لهذي الفئات ⸎*
*✥⟢ انمي ⟣✥*
*✥⟢ مانجا ⟣✥*
*✥⟢ مانهوا ⟣✥*
*~₪ تنبية┊ النقابة مختلطة  ₪~*

*〄━━━╼⦿┄⦁╏🐉╏⦁┄⦿╾━━━〄*

*~تــ✍︎ــوقــيــع مملكة┊📜┊↯:~*
*_~☬〘╎𝑺𝑶𝑼𝑳 𓆩 🐉 𓆪 𝑺.𝑼.𝑳╎〙☬~_*`])} 
 `.trim();

    conn.sendFile(m.chat, randomVideo, null, teks, m);
}

handler.command = ['استمارة', 'استماره', 'الاستمارة', 'الاستماره'];
handler.group = true;

export default handler;

function pickRandom(list) {
    return list[Math.floor(Math.random() * list.length)];
}
