let handler  = async (m, { conn }) => { 
const name = conn.getName(m.sender);
let a='./Guru.jpg'
let taguser = '@' + m.sender.split("@s.whatsapp.net")[0]
let more = String.fromCharCode(8206);
let done = '✅';
      m.react(done);
 let teks = ` 
 ${pickRandom([`*•∙∙━━✧【استمارة المشتريات】✧━━∙∙•*

*مرحبا بكم في ✦『⇜𝑻𝒊𝒎𝒑𝒆𝒔𝒕𝐞🌀』✦*

*هنا تجد*

*السلع  🛒*			
*السعر  💰*
*المدة   🕔*	

*⟣⦁─♅─⦁⟢ ⌯⊰ ✣ ⊱⌯ ⟣⦁─♅─⦁⟢*

*🔰 الحمايه*
*يوم	!	حمايه محد يسرقك 150K*

*دائم	!	 1.5M	حذف انذار 🌄*

*دائم	!	2.5M			حذف انذارين🔰*

*دائم	!		3M			حذف جميع الانذارات 👑*
*في حال انك تخالف		وتحذف الانذارت كل شوي راح يجيك طرد مؤبد*

*⟣⦁─♅─⦁⟢ ⌯⊰ ✣ ⊱⌯ ⟣⦁─♅─⦁⟢*

*قسم المشتريات العادية🎊*


*1- تغيير افتار الاساسي ( المدة يوم )  { 1M }*

*2- تغيير افتار الإعلانات ( المدة يوم )  { 2M }*

*3- تغيير افتار الفعاليات ( المدة يوم )  { 3M }*

*الحد الاقصى لمدة التغيير يوم*		

*2-تغيير لقب { 1M } ( تستطيع تغيير لقبك كل اسبوع )*
									
*3- تبادل اللقاب لمدة اسبوع { 1.5M } ( في حال موافقة الطرفين )* 						

*4- حجز لقب لمدة اسبوع { 2M } .... شهر { 6M }*	
								
*5- وضع لقب بجانب اسم القروب 12 ساعة { 8M }*
									
*6- شراء يوم مفتوح خاص بك { 2.5M }*				

*7- شراء يوم مفتوح للقروب كامل { 4M }*

*8- دخول إدارة المملكة لمدة يوم { 4M }*
	
*9- دبل نقاط الفعاليات المدة يوم ×2 { 2.5M }*

*10-تربل نقاط الفعاليات المدة يوم ×3 { 4M }*
				
*الحد الاقصى يومين*

*ملاحظة : التدبيل يشمل نقاط الجميع* 									

*⟣⦁─♅─⦁⟢ ⌯⊰ ✣ ⊱⌯ ⟣⦁─♅─⦁⟢*

*قسم الزيارات ✈️*


~*1- زيارة لمدة يوم { 1.6M }*~

~*تفتح الزيارات يوم الخميس*~

~*الحد الاقصى للزيارة 4 ايام*~

~*2- النقل النهائي { 10M }*~

_*لسا مافتحنا زيارات ✈️*_

*⟣⦁─♅─⦁⟢ ⌯⊰ ✣ ⊱⌯ ⟣⦁─♅─⦁⟢*


*قسم ال VIP 🤵🏻‍♂*

~*لسا*~

*⟣⦁─♅─⦁⟢ ⌯⊰ ✣ ⊱⌯ ⟣⦁─♅─⦁⟢*


*توقيع إدارة*
      ~*✦『◈𝐢𝐜𝐞⊰🌀⊱𝑻𝒊𝒎𝒑𝒆𝒔𝒕◈』✦*~
*' 𝐷𝐼𝐴𝐵𝐿𝑂᯽𝐵𝑂𝑇 ✧'*`])} 
 `.trim() 
 conn.sendFile(m.chat, a, null, teks, m)}
 
 handler.command = ['متجر','المتجر']
 handler.admin = true

 export default handler 
  
 function pickRandom(list) { 
     return list[Math.floor(Math.random() * list.length)] 
   }