import { createHash } from 'crypto';
let handler = async (m, { conn }) => {
const name = conn.getName(m.sender);
let a = './image.jpg';
let who = m.quoted ? m.quoted.sender : m.mentionedJid && m.mentionedJid[0] ? m.mentionedJid[0] : m.fromMe ? conn.user.jid : m.sender
let more = String.fromCharCode(8206);
let done = '📯';
  m.react(done);
let teks = `
${pickRandom([`
┏────━━━━⊚📯⊚━━━━────┓
*⧉┆↵ اهـــلا بــك/ي ${name}*
*⧉┆📱: @${who.replace(/@.+/, '')}*
*⧉┆↜أنـا اسـمـــي ❮ ˹دیــابـلــو˼ ❯*
*⧉┆↜انــا خــادم الـسـیــد ريــمـورو*
*✦━☆━ـ❃ ⊰ ⛩ ⊱ ❃ـ━☆━═✦*
*▪︎▪︎❯【✮ ســــوالــــف ✮】❮▪︎▪︎*

📕 | الامــر *⏎* همم  

📕 | الامــر *⏎* ديـابـلـو اسمع  

📕 | الامــر *⏎* ديـابـلـو انت انسان؟

📕 | الامــر *⏎* ديـابـلـو قول مياو

📕 | الامــر *⏎* ديـابـلـو منجدك؟

📕 | الامــر *⏎* افا

📕 | الامــر *⏎* عيوني

📕 | الامــر *⏎* ديـابـلـو انقلع

📕 | الامــر *⏎* ديـابـلـو اشتقت لك

📕 | الامــر *⏎* ديـابـلـو ملل

📕 | الامــر *⏎* ديـابـلـو منور

📕 | الامــر *⏎* ديـابـلـو اخرس

📕 | الامــر *⏎* ديـابـلـو صباح الخير

📕 | الامــر *⏎* ديـابـلـو مساء الخير

📕 | الامــر *⏎* ههههههه

📕 | الامــر *⏎* ديـابـلـو شتسوي

📕 | الامــر *⏎* ديـابـلـو كل تبن

📕 | الامــر *⏎* ديـابـلـو كيفك

📕 | الامــر *⏎* ديـابـلـو تحبني

📕 | الامــر *⏎* ديـابـلـو مع السلامة

📕 | الامــر *⏎* بــوو

📕 | الامر *⏎* بــخ

📕 | الامــر *⏎* ديـابـلـو صـلـي عـلـى الـنـبـي

📕 | الامــر *⏎*  ديـابـلـو ادعـيـة

📕 | الامــر *⏎* ديـابـلـو انــمــيــات طــويــلــة

📕 | الامــر *⏎* ديـابـلـو انــمــيــات قــصــيــرة

📕 | الامــر *⏎* ديـابـلـو تــقــبــل رشــاوي؟

📕 | الامــر *⏎* ديـابـلـو تــكــرهــنــي؟

📕 | الامــر *⏎* ديــابــلــو تــســت

📕 | الامــر *⏎* انــا رحــت

📕 | الامــر *⏎* ديـابـلـو احــبــك

📕 | الامــر *⏎* ديـابـلـو نــرتــبــط؟ 

📕 | الامــر *⏎* ديـابـلـو كــم عــمــرك؟

📕 | الامــر *⏎* ديــابــلــو اكــرهــك

📕 | الامــر *⏎* ديـابـلـو تــرانــي طــفــشــان

📕 | الامــر *⏎* ديـابـلـو قــول اونــي تــشــان

📕 | الامــر *⏎* ديـابـلـو وش اطــلــق انــمــي؟

📕 | الامــر *⏎* ديـابـلـو تــصــبــح عــلــى خــيــر

📕 | الامــر *⏎* ديـابـلـو اعــطــيــنــي بــوســة

✦═━━☆━ـ❃ ⊰ ⛩ ⊱ ❃ـ━☆━━═✦
*ل إلــغــاء تــنــشــيــط الــبــوت فــي هــذه الــمــجــمــوعــة 🛑*\n*اكــتــب .بــانــد*
          *.¸¸ ❝˼𝐷𝐼𝐴𝐵𝐿𝑂᯽𝐵𝑂𝑇˼❝ ¸¸.*
*┗────━━━━⊚📯⊚━━━━────┛*`])}
`.trim()
conn.sendFile(m.chat, a, null, teks, m, null, { mentions: [who] })}

handler.help = ['']
handler.command = ['سواليف','سوالف'];

export default handler

function pickRandom(list) {
  return list[Math.floor(Math.random() * list.length)];
}