import { createHash } from 'crypto'
let handler  = async (m, { conn }) => { 
let a = './Rules.jpg'
let more = String.fromCharCode(8206);
let done = '✅';
m.react(done);
 let teks = ` 
 ${pickRandom([`~*_✥━═◈𝑺.𝑼.𝑳⊰🐉⊱𝑺𝑶𝑼𝑳◈═━✥_*~

*قوانين القروب لكل مخالفة يترتب عليها طرد او انذار ⭕️*

*⟣⦁─♅─⦁⟢ ⌯⊰ ✣ ⊱⌯ ⟣⦁─♅─⦁⟢*

*المخالفات التي يترتب عليها الإنذار 🚫⤵︎⦂*

*❲𝟏❳ ⦂ السب ⚠︎︎ ⇜ انذار*

*❲𝟐❳ ⦂ ارسال 4 ملصقات متتالية ←انذار*

*❲𝟑❳ ⦂ التلفظ او التقليل من المشرف 🕵🏻‍♂️🕵🏻‍♀️⇜ انذارين*

*❲𝟒❳ ⦂ طلب الإشراف 🚫⇜انذار*

*❲𝟓❳ ⦂ ارسال صوره او مقطع فيديو خارج الانمي ⇜ انذار*
*「يسمح فقط يوم الخميس والجمعة」*
 
*❲𝟔❳ ⦂ مضايقة العضو مرتين⇜انذار* 

*❲𝟕❳ ⦂ ارسال مقطع او صوره او GIF خلال مسابقة ⇜ انذار*

*❲𝟖❳ ⦂ ارسال ملصق لشخصية شعبية مع تحويل جنسها ⇜ انذار*

*❲𝟗❳ ⦂ التحدث عن الحلقة بعد نزولها باقل من يوم ⇜ انذار*

*⟣⦁─♅─⦁⟢ ⌯⊰ ✣ ⊱⌯ ⟣⦁─♅─⦁⟢*

*المخالفات التي يترتب عليها الطرد 🚫⤵︎⦂*

*❲𝟏❳ ⦂ الحرق بجميع انواعة 🤐 ⇜ طرد*

*❲𝟐❳ ⦂ إرسال صور او مقاطع مخلة بالآداب ⇜ طرد*

*❲𝟑❳ ⦂ الحديث عن السياسة أو المذاهب 🧐 ⇜ طرد* 

*❲𝟒❳ ⦂ العنصرية بجميع انواعها 「جنسية،عرقية، طائفية. الخ..」⇜ طرد* 

*❲𝟓❳ ⦂ التهديد بالتبنيد او التهكير ⇜ طرد*

*❲𝟔❳ ⦂ ذكر اي شيء متعلق بالشواذ ⇜ طرد*

*❲𝟕❳ ⦂ الاحتكاك بالطرف الآخر ⇜ طرد*

*❲𝟖❳ ⦂ سرقة الاعضاء ⇜ طرد*

*❲𝟗❳ ⦂ الإعلان او النشر ⚠︎︎ ⇜ طرد*

*⟣⦁─♅─⦁⟢ ⌯⊰ ✣ ⊱⌯ ⟣⦁─♅─⦁⟢*


    *━┄═⏣❗ملاحظات❗⏣═┄━*

*❶ ➺ اي حرق بترسله قول حرق وحط علامة 🛑 「مع تحديد اسم الانمي」* 

*❷ ➺ 3 طرد مباشر = طرد نهائي*

*❸ ➺ عندك رأي او اعتراض تفضل خاص وقوله*

*❹ ➺ الاعتراض على الانذار يجب ان يكون بالخاص ان كان بالعام سيسجل عليك انذار ومن الممكن تطرد*

*❺ ➺ يحق للمشرف فرض أي عقوبة يراها مناسبة للمخالفة*

*❻ ➺ خروجك من الاعلانات يعني طردك من الاساسي*

*❼ ➺ يستطيع الرئيس، أن يُطبِق قانون غير مُدون*

*❽ ➺ التنبيه يعطى حسب تقدير المشرف*
*⟣⦁─♅─⦁⟢ ⌯⊰ ✣ ⊱⌯ ⟣⦁─♅─⦁⟢*

*قائمة الانذارات 🚫 ⤵︎:*
*2 تنبيه ⇠ انذار واحد*
*4 انذارات ⇠ طرد لمدة يوم* 
*6 انذارات ⇠ طرد 𝟑 ايام وقد يمتد الى اسبوع*
*𝟖 انذارات ⇠ طرد نهائي ❌*

*يستطيع الرئيس، أن يُطبِق قانون غير مُدون ◈*

*التنبيه يُعطى حسب تقديّر المشرف ◈*

*⟣⦁─♅─⦁⟢ ⌯⊰ ✣ ⊱⌯ ⟣⦁─♅─⦁⟢*
*~تــ✍︎ــوقــيــع مملكة┊📜┊↯:~*
*_~☬〘╎𝑺𝑶𝑼𝑳 𓆩 🐉 𓆪 𝑺.𝑼.𝑳╎〙☬~_*
*↓ رابط موثوق✔️*
*القوانين على المتصفح*
*https://msha.ke/soultimpest*`])} 
 `.trim() 
 conn.sendFile(m.chat, a, null, teks, m)}

 handler.command = ['قوانين','القوانين']
 handler.admin = true

 export default handler 

 function pickRandom(list) { 
 return list[Math.floor(Math.random() * list.length)] 
   }